tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "jstkdng/programs"
tap "nikitabobko/tap"
# All-in-one AI-Powered CLI Chat & Copilot
brew "aichat"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Download with resuming and segmented downloading
brew "aria2"
# Archival front-end
brew "atool"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Emacs dependency management
brew "cask"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Interactive terminal based UI application for tracking cryptocurrencies
brew "cointop"
# Color-highlighted diff(1) output
brew "colordiff"
# Shell script to build fancy DMGs
brew "create-dmg"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Modern replacement for 'ls'
brew "exa"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Identify or delete duplicate files
brew "fdupes"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# I/O benchmark and stress test
brew "fio"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# GIF image/animation creator/editor
brew "gifsicle"
# Distributed revision control system
brew "git"
# Render markdown on the CLI
brew "glow"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Powerful, lightweight programming language
brew "lua"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@75"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Utility to optimize JPEG files
brew "jpegoptim"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Terminal file manager
brew "lf"
# Implementation of the file(1) command
brew "libmagic"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Mac App Store command-line interface
brew "mas"
# Unified display of technical and tag data for audio/video
brew "media-info"
# Terminal-based visual file manager
brew "midnight-commander"
# NCurses Disk Usage
brew "ncdu"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Realtime console network usage monitor
brew "nload"
# Platform built on V8 to build network applications
brew "node"
# Retrieves currently playing media, and simulates media actions
brew "nowplaying-cli"
# Command-line Git information tool
brew "onefetch"
# PNG file optimizer
brew "optipng"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Swiss-army knife of markup format conversion
brew "pandoc"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# File browser
brew "ranger"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Cross-shell prompt for astronauts
brew "starship"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Powerful free data recovery utility
brew "testdisk"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash", link: true
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Simple terminal image viewer written in Rust
brew "viu"
# Pager/text based browser
brew "w3m"
# Show the current WiFi network password
brew "wifi-password"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Tracks most-used directories to make cd smarter
brew "z"
# Compression and file packaging/archive utility
brew "zip"
# UNIX shell (command interpreter)
brew "zsh"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Drop in replacement for ueberzug written in C++
brew "jstkdng/programs/ueberzugpp"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Enable Windows-like alt-tab
cask "alt-tab"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Colour picker
cask "colorsnapper"
# Photography workflow application and raw developer
cask "darktable"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-monaspace"
cask "font-sf-mono"
cask "font-sf-pro"
# Grammarly for desktop
cask "grammarly-desktop"
# Archive manager for data compression and backups
cask "rar"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
mas "CleanMyMac", id: 1339170533
mas "Dropover", id: 1355679052
mas "Keynote", id: 409183694
mas "Microsoft Outlook", id: 985367838
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
vscode "alefragnani.project-manager"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "drmerfy.overtype"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "github.vscode-pull-request-github"
vscode "glenn2223.live-sass"
vscode "kamikillerto.vscode-colorize"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "pkief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "ritwickdey.liveserver"
vscode "streetsidesoftware.code-spell-checker"
vscode "syler.sass-indented"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "wallabyjs.quokka-vscode"
vscode "xabikos.javascriptsnippets"
